[
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer - TikTok Backend",
    "company": "TikTok",
    "place": "Mountain View, CA",
    "date": "2020-10-14",
    "description": "Responsibilities 1. Develop large-scale software systems that powers TikTok app; 2. Improve system design and architecture to ensure high stability and performance of the services; 3. Collaborate with multiple cross-functional teams to deliver high quality work in rapid product development. Qualifications 1. BS/MS Degree in Computer Science or related major, with 2-5+ year working experience; 2. Experienced in building backend services for large-scale consumer-facing applications; 3. Proficient in at least one of following languages: Java, Go, C++, Python, Java; 4. Deep understanding of computer architectures, data structures and algorithms; 5. Have good team communication and collaboration skills. Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-tiktok-backend-at-tiktok-2184310476?refId=65eb216d-c988-47cf-9445-234cf2399959&position=1&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Associate",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Oracle",
    "place": "Hyderabad, Telangana, India",
    "date": "2020-10-15",
    "description": "Oracle Data Cloud helps marketers use data to capture consumer attention and drive results. Used by World's Top advertisers, our Audience, Context and Measurement solutions extend across the top media platforms and a global footprint of more than 100 countries. Imagine working on one of the most important issues surrounding digital marketing and advertising today, using massive online and offline data sets and predictive analytics to create digital consumer audiences to drive superior marketing results. This is a tremendous opportunity to shape the future of digital marketing and advertising, and the Oracle Data Cloud (ODC) is at the forefront of creating new types of targeting capabilities for marketers all over the world. Our technology stack involves various programming languages/framework (Java, Python, Scala, spring boot etc.), Big Data technologies (Spark, Hadoop/Hive, Kafka, various relational databases etc.), frontend technologies (Reactjs etc.). Desired Skills & Experience: Bachelor’s degree in Computer Science or related field 3 to 5 years of experience building large scalable applications Algorithms / Data structures Java Containers: Mesos, Kubernetes Databases & Storage technologies Self-motivated and fast self-learner. Adaptable to changing environments. Excellent analytical and Problem Solving Skills Good team player Good understanding of System programming, Performance engineering, distributed systems. Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-oracle-2184378907?refId=65eb216d-c988-47cf-9445-234cf2399959&position=2&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Mid-Senior level",
    "jobFunction": "Information Technology, Consulting, Product Management",
    "employmenttype": "Full-time",
    "industries": "Computer Software, Research, Information Services"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "DocuSign",
    "place": "Seattle, WA",
    "date": "2020-10-14",
    "description": "Software Engineer Engineering & Tech Operations | Seattle, Washington Our agreement with employees DocuSign is committed to building trust and making the world more agree-able for our employees, customers and the communities in which we live and work. You can count on us to listen, be honest, and try our best to do what’s right, every day. At DocuSign, everything is equal. We each have a responsibility to ensure every team member has an equal opportunity to succeed, to be heard, to exchange ideas openly, to build lasting relationships, and to do the work of their life. Best of all, you will be able to feel deep pride in the work you do, because your contribution helps us make the world better than we found it. And for that, you’ll be loved by us, our customers, and the world in which we live. The team Our Engineering & Tech Operations team builds and operates complex solutions for global business challenges that cross cultures, legal jurisdictions, and impacts millions of people and businesses every day. We hire people with a broad set of skills and people who want to work on creating never-been-done-before solutions at scale while ensuring world-class reliability and security. Our Agreement Cloud is a revolutionary solution that changes the way people live, work, and come to agreement. This position The Software Engineer on the Engineering systems team will be responsible for building and maintaining key features that are integral to our customers and business. The team is self-driven, passionate, and creates quality features. A successful person in this role will have a flexible attitude combined with an aptitude to learn and share. This person enjoys working in a fast-paced agile environment, cares about their decisions, and is focused on quality driven development. Responsibilities Software engineers work with teammates to solve problems and build innovative software solutions. You will also be expected to demonstrate an ability to learn and adopt relevant new technologies, tools, methods and processes to leverage in your solutions. As a software engineer, you are dedicated to building software to empower every organization in the company to achieve more. Write automated unit tests to ensure the quality of the code Participate in code reviews Identify and automate test cases and improve existing integration testing processes Basic Qualifications A Computer Science degree or a related technical field. Completed courses focused on Data Structures and Algorithms. Currently pursuing a degree in Computer Science or a related technical field and enrolled for one quarter or semester following intern role. Completed courses focused on Data Structures and Algorithms. This position is not eligible for visa sponsorship. Preferred Qualifications Coding and design experience, preferably in an OO programming language like Java, Scala, C# Experience in powershell or python Experience with git, continuous integration, and deployment tools Experience in unit testing Excellent communication skills About Us DocuSign® helps organizations connect and automate how they prepare, sign, act on, and manage agreements. As part of the DocuSign Agreement Cloud, DocuSign offers eSignature: the world's #1 way to sign electronically on practically any device, from almost anywhere, at any time. Today, hundreds of thousands of customers and hundreds of millions of users in over 180 countries use DocuSign to accelerate the process of doing business and simplify people's lives. Plus, we save more trees together! And that’s a good thing. DocuSign is an Equal Opportunity Employer. DocuSign is committed to building a diverse team of talented individuals who bring different perspectives to the discussion and who feel a sense of inclusion and belonging when they join our team. Individuals seeking employment at DocuSign are considered without regards to race, ethnicity, color, age, sex, religion, national origin, ancestry, pregnancy, sexual orientation, gender identity, gender expression, genetic information, physical or mental disability, registered domestic partner status, caregiver status, marital status, veteran or military status, citizenship status, or any other legally protected category. Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-at-docusign-2184361198?refId=65eb216d-c988-47cf-9445-234cf2399959&position=3&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Computer Software"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer, Backend",
    "company": "Airbnb",
    "place": "Beijing, Beijing, China",
    "date": "2020-09-18",
    "description": "About Airbnb Airbnb is one of the world’s largest marketplaces for unique, authentic places to stay and things to do, offering over 7 million accommodations and 40,000 handcrafted activities, all powered by local hosts. An economic empowerment engine, Airbnb has helped millions of hospitality entrepreneurs monetize their spaces and their passions while keeping the financial benefits of tourism in their own communities. With more than half a billion guest arrivals to date, and accessible in 62 languages across 220 countries and regions, Airbnb promotes people-to-people connection, community and trust around the world. About Airbnb China As an independent business unit, China is one of the major engines behind Airbnb's global growth. The company has increased its investment in China and experienced rapid growth since officially entering the market at the end of 2015. Airbnb continues to focus on product localization and innovation to better serve local users and enhance the user experience, nurture a trusting local community, and engage Chinese Millennial travelers with inspiring brand moments. As one of the leaders in the home sharing industry, Airbnb works with partners across many fields to actively promote the sustainable development of this emerging industry and achieve win-win results for everyone. Airbnb will continue to build an efficient local team, bringing the end-to-end, authentic travel experience to Chinese travelers, and creating a world where \"anyone can belong anywhere\". About The Engineering Team China is one of the largest and fastest growing travel markets and a critical piece to Airbnb's mission. Here we want to build a localized product team that best serves Chinese users and market, enabling everyone to truly \"belong anywhere\". We are now looking for talented software engineers to join the team, to help us build a strong and fast feedback loop, and adapt our products according to local needs. You will have the chance to thrive on a global platform empowered by deep and localized innovations while building a unique experience for Chinese users. 爱彼迎公司简介 爱彼迎是全球领先的特色住宿和体验项目预订平台，提供700多万个独具当地特色的住宿选择和4万项精心策划的体验活动，均由当地房东和体验达人倾力打造。作为赋能经济发展的引擎之一，爱彼迎正在帮助数以百万计的旅游服务创业者将房源和爱好转化为收入，也让当地社区享受到了旅游业带来的经济效益。迄今为止，爱彼迎已接待超过5亿人次房客，在全球220个国家和地区提供62种语言服务。爱彼迎致力于在全球范围内促进人与人之间的交流和信任，打造充满人情味的社区。 爱彼迎中国简介 作为一个独立的业务部门，中国是Airbnb爱彼迎全球增长的重要引擎之一。自2015年底正式进入中国起，爱彼迎在中国市场不断加大投入，实现了持续快速增长。爱彼迎将持续升级本土产品，打造创新的品牌活动，提升用户体验，构建有凝聚力的社区。作为共享住宿行业的领军者之一，爱彼迎还携手各方，积极推动这一新兴行业的可持续发展，实现多方共赢。我们将继续打造高效的本土团队，将原汁原味的旅行体验带给中国旅行者，创造“家在四方”的归属感，重新定义旅行。 关于爱彼迎工程团队 中国是世界上最大也是发展最快的旅游市场，同时也是爱彼迎「家在四方」愿景的重要组成部分。我们的中国工程团队希望通过打造本土化的团队和产品来更好的服务中国的用户，实现我们的愿景。 现在我们需要像你这样的优秀工程师的加入，来帮助我们打造更快更好的产品业务流程，迭代速度，和本地化体验。如果你想拥有世界级的平台，来发挥你的聪明才干，让你的亲朋好友直接使用到你参与实现的本土化产品和体验，还等什么呢？ 我们寻找的人 计算机或软件行业三年以上全职工作经验 在后端多个技术栈和技术层级上有技术过硬、游刃有余的能力 熟练掌握 Java 或任意一门主流面向对象编程语言 熟练掌握数据库 schema 设计和数据库操作 为能够通过产品迭代来推动业务发展感到兴奋 拥有较强逻辑思考和分析能力，愿意以数据驱动的方式来做产品决策 积极沟通，拥抱变化，快速学习 良好的英语读写能力和至少基础的听说能力 你的职责 以数据驱动的方式，参与或者负责设计、开发、测试、上线、迭代爱彼迎中国的产品和相关业务的后端和接口 交付和维护安全可靠、高质量高性能的产品、代码、服务和文档 Show moreShow less",
    "link": "https://cn.linkedin.com/jobs/view/software-engineer-backend-at-airbnb-2181304331?refId=65eb216d-c988-47cf-9445-234cf2399959&position=4&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Research, Engineering",
    "employmenttype": "Full-time",
    "industries": "Hospitality, Internet, Leisure, Travel & Tourism"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Backend Software Engineer",
    "company": "Italic",
    "place": "Delhi, Delhi, India",
    "date": "2020-10-15",
    "description": "Backend Software Engineer New Delhi /Technology /Full-TimeItalic is quality, at cost — our members access hundreds of quality goods from the same manufacturers as top brands at cost. We currently offer men's and women's apparel, accessories, and footwear, and home goods like bedding, bath, cookware, and more.Italic is an equal opportunity employer and we value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We don't care about where you went to college, your degree, your age, or what fancy names you might have on your resume. Instead, we're looking for good people: good at work and with a good heart . Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/backend-software-engineer-at-italic-2210221106?refId=65eb216d-c988-47cf-9445-234cf2399959&position=5&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "PayPal",
    "place": "Bengaluru, Karnataka, India",
    "date": "2020-10-09",
    "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 286 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. Job Description Summary: PayPal's consumer onboarding team is looking for a Full stack Java script engineer in Bangalore to work on the next generation progressive onboarding stack. We want people who demonstrates great software craftsmanship and has a passion for delivering superior user experiences. As a member of the team, you will directly work with the product owners and designers to create outstanding solutions and deliver incredible products. Job Description: We are looking for the best Full Stack Web Application engineers, who have a passion for developing massively scalable, distributed software systems that require high availability to support mission-critical business tasks. Quality is at the forefront of everything our team does, and we are looking for true passion for writing robust, re-usable, scalable and well-tested code. On the personality side, you are the right person for PayPal if you are willing to: Drive to get results and not let anything get in your way. Be proactive and anticipate/handle issues before they blowup. Demonstrate a high level of curiosity and keep abreast of the latest technologies. Show pride and passion for helping businesses thrive around the globe. Responsibilities: As a Software engineer, you will be responsible for working on applications and services that handle consumer onboarding. You will work in a fast-paced environment where continuous innovation and experimentations are a given. You will master both established and cutting-edge technologies like, JavaScript, NodeJs, ReactJs, Redux, HTML5, CSS3. Your responsibilities will also include: Development and testing of web applications and services following best practices Work closely with design & product to craft great product experiences Assist with application deployments in our Cloud environment Identify and document best practices Requirements: Solid knowledge of algorithms and strong problem solving skills Have a passion for quality and writing clean, readable code that scales and performs well Good interpersonal communication skills Experience in client & server-side JavaScript, HTML5, CSS3, ReactJs, Redux, Node.js and webpack 3+ years of software design and web application development BS or equivalent degree in Computer Science We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom. PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. REQ ID R0061077 Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-paypal-2185770146?refId=65eb216d-c988-47cf-9445-234cf2399959&position=6&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Computer Software, Financial Services, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer - Backend",
    "company": "Postman",
    "place": "Bengaluru, Karnataka, India",
    "date": "2020-10-15",
    "description": "Description Postman is the only complete API development environment. Today we have 11+ million developers and over 500K companies using our comprehensive set of built-in tools to support every stage of the API lifecycle. With Postman you can design, mock, debug, test, document, monitor, and publish your APIs all in one place. About The Team The team works closely with the Product teams to build APIs that enable delightful experiences for developers who build modern software for the API first world. We’re a small team that learns from each other and iterates rapidly to make a large impact. Our Microservices are written in Node.js, MySQL and Linux deployed on the AWS Platform. A Taste Of Our Scale 700k+ daily active users 200+ million requests per day spread across 30+ microservices resting around 20 TB of data ingesting around 2TB of monthly internal service logs 200k+ peak concurrent web socket connections This position reports to one of our Engineering Managers. Responsibilities Build and own microservices while working with a cross-functional team of Product Managers, Designers, Support and Product, Quality, Security and Platform Engineers. Manage the roadmap and SLAs for the microservices that you own. Create and periodically review Architectural diagram for the Microservices and manage their dependencies. Perform Code reviews. Deploy and monitor versions, retire older versions and push patch fixes. Manage Mocks, Docs, Monitors, Integration and Contract Tests using Postman. On-board, mentor and off-board developers within the Microservices you own. Requirements You’ve been building web applications for 3+ years. You’ve experience with high level programming languages - e.g. Node.js, PHP, Python, Ruby, Go. We code primarily in Node.js, so you’ll be excited to either ramp up on that or continue building awesome things with it. You possess strong Computer Science fundamentals - Algorithms, Databases, Networking and Distributed systems. You write testable, maintainable code that’s easy to understand. You are a strong communicator who can explain complex technical concepts to product managers, designers, support and other engineers. You enjoy helping onboard new team members, mentoring, and teaching. You have curiosity about how things work. Benefits This position will be located in our beautiful office at 100 ft road, Indiranagar in Bangalore. You will enjoy our incredible perks: home-cooked meals, snacks, game room, flexible hours, ergonomic workstations and cuddles from our endearing Chief Happiness Officer, Cooper.What you will also get to experience is a company that believes in autonomous small teams for maximum impact; that strives for organizational growth to align with that of the individual; that continuously and purposefully builds an inclusive culture where everyone is able to do and be the best version of themselves and where ideas are encouraged from anyone and everyone. We seek people who naturally demonstrate our values, who not only understand the challenge but can also solve this for the rest of the world. Be a part of something big. Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-backend-at-postman-2208977267?refId=65eb216d-c988-47cf-9445-234cf2399959&position=7&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Computer Software, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Siemens Technology India",
    "place": "Bengaluru, Karnataka, India",
    "date": "2020-09-19",
    "description": "Software Developer (Babylon JS) Electrical Energy keeps the world moving. No matter where the power comes from or where it needs to go we make sure it makes its way. Can you help us shape the future? We’re looking for dedicated people with the skills and vision to build a better tomorrow. Join our Smart Grids and Infrastructure team as a Power System Engineer and help us create the technology that will transform entire industries, cities and even countries. Welcome to our world! Join us now. What Part Will You Play We need a Software developer to design software solutions based on requirements and within the constraints of architectural /design guidelines. You will derive software requirements and software functional specification, validate software requirements, provide software feasibility analysis and software effort estimation. Accurate translation of software architecture into design and code. Guide Scrum team members on all design topics & implementation consistency against the design/architecture You will be involved in coding of features and/or bug-fixing and delivering solutions adhering to coding and quality guidelines, for self-owned components Guide the team in test automation design and also towards implementation of the same. We don’t need superheroes, just super minds! You should have 2 to 6 years of experience on Babylon JS or other similar WebGL libraries with experience in Designing, building and maintaining efficient, reusable, and reliable code Proficient at collaborating with UI / UX designers and implementing UI systems. Should have experience with 3D and working knowledge of WebGL or OpenGL, and the math associated with the same You must have knowledge of JavaScript or typescript Use the Babylon JS platform to develop & maintain the 3D engineering application You need to have deep understanding and hands on experience on handling NFRs Experience working with Git /Bit-bucket and Full stack development We’ve got quite a lot to offer. How about you? This role is based in Bangalore. You’ll also get to visit other locations in India and beyond, so you’ll need to go where this journey takes you. In return, you’ll get the chance to work with teams impacting entire cities, countries – and the shape of things to come. We’re Siemens. A collection of over 379,000 minds building the future, one day at a time in over 200 countries. We're dedicated to equality and we welcome applications that reflect the diversity of the communities we work in. All employment decisions at Siemens are based on qualifications, merit and business need. Bring your curiosity and creativity and help us craft tomorrow. Find out more about Siemens careers at: www.siemens.com/careers Organization: ADVANTA Company: Siemens Technology and Services Private Limited Experience Level: Experienced Professional Job Type: Full-time Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-siemens-technology-india-2183017002?refId=65eb216d-c988-47cf-9445-234cf2399959&position=8&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Research",
    "employmenttype": "Full-time",
    "industries": "Electrical/Electronic Manufacturing"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Dialpad",
    "place": "Vancouver, British Columbia, Canada",
    "date": "2020-10-15",
    "description": "Dialpad is the most modern business communications company in the industry. Our products range from conferencing calling, to phone systems to contact center solutions that are all built with the end-user in mind. We allow workers to be productive from anywhere on any device and have moved all the power of an on-premise phone system or contact center to the cloud to be accessed and used by modern workers in today's Work from Anywhere environment. Who We Are At Dialpad, work isn't a place you go, it's a thing you do. We not only build products to enable the everywhere worker, but we also are everywhere workers. With offices in San Francisco, San Ramon, Austin, Raleigh, Vancouver, Waterloo, Tokyo, London and Bangalore, we truly believe in finding the best talent everywhere. We also embrace the Work from Home movement and are just as happy hiring great talent from anywhere if they choose to work from home rather than in an office. With $120 million in funding from ICONIQ Capital, Google Ventures, Andreessen Horowitz, Scale Ventures and other top VC's Dialpad attracts top engineers from companies like Microsoft and Google, and every member of our team plays an essential role in creating dynamic products that enable workers to be productive from anywhere. About The Role We are looking for engineers to work efficiently as part of our professional software engineering team; learning to own and support features past delivery and through their full life-cycle. As an Engineer at Dialpad, you will work with a close-knit product engineering team and technical lead. Our teams are cross disciplinary, and include Product Managers, Designers, QA, and other Engineers (Data Engineering, Data Science, Telephony). You will participate in design meetings and ask clarifying questions to fully understand customer scenarios and requirements. You will work with consumer/dependency owners for design review and sign-off, be a technical leader within your software feature, mentor and share knowledge with the rest of the engineering team. Responsibilities Develop easy-to-use, scalable, robust, high volume interactive client/server applications Code with Vue.JS and other JavaScript libraries and have an excellent command over HTML, and CSS Work with Python on Google App Engine Cloud Datastore (NoSQL database) Memcache (distributed cache) Analysis with BigQuery Debug with StackDriver Work with real-time communication mechanisms such as WebRTC and WebSockets Interface with designers, product managers, and other engineers (our policy: with fewer organized meetings, engineers have more time to code) Launch new code weekly with our fast release cycles Owning the release of the server and client in a rotation as release engineer Improve performance to handle rapid increase in user base Writing backend and frontend unit tests Monitoring and alerts in Datadog Participating in Python and JavaScript code reviews Traits we'll look for in you We hire smart Engineers that are willing to learn new technologies and take ownership in the work they are assigned to. When it comes to your background, we are extremely flexible with industry experience and the technologies you have worked with in the past. If you like to tackle complex engineering problems, build scalable cloud-based features in a full-stack capacity and love taking features from design to production, then you are the engineer for us! Technology Stack Python, Django, JavaScript, Vue.JS, NoSQL, Google Cloud and Google App Engine. About Us Joining our team means collaborating with people that aren't just passionate about their work but about Argentine tango, musicals, sushi burritos, comic books - you name it. Because if you're going to redefine the status quo, you need a group of people hungry to do more, to see more, and be more than where they started. There is no idea too crazy and no task too small — we work together to make things we're proud of. Compensation & Equity Teamwork makes the dream work. We recognize that our dedicated team members are what make us successful. That's why we offer competitive salaries in addition to stock options. Healthcare An apple a day keeps the doctor away - and it doesn't hurt that we offer 100% paid medical, dental, and vision plans for all employees. Reimbursements We offer a monthly stipend to help cover your cell phone, home internet, and even gym membership costs. Education We believe in your future as much as you do! That's why we offer a yearly stipend for continued learning and education expenses. Office Meals Bon Appetit! Enjoy catered lunches, free snacks & drinks (both healthy and unhealthy - no judgment!) Location, Location, Location San Francisco <> San Ramon <> Austin <> Raleigh <> Vancouver <> Kitchener <> Tokyo <> New York <> Bangalore. From coast to coast, our offices are nestled in active and growing downtown areas Dialpad is an equal opportunity employer; we believe in creating a community of inclusion and an environment free from discrimination or harassment. Show moreShow less",
    "link": "https://ca.linkedin.com/jobs/view/software-engineer-at-dialpad-2208247011?refId=65eb216d-c988-47cf-9445-234cf2399959&position=9&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Computer Software, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer - Backend",
    "company": "FARFETCH",
    "place": "Porto, Porto, Portugal",
    "date": "2020-09-18",
    "description": "Farfetch exists for the love of fashion. We believe in empowering individuality. Our mission is to be the global platform for luxury fashion, connecting creators, curators and consumers. We’re a diverse and global community made up of Farfetchers, our partners and our customers, which we believe is at the heart of our success. Everything we do is centred around our values - Be Human, Think Global, Be Revolutionary, Todos Juntos, Be Brilliant, Amaze Customers - which define our beliefs and our actions. We welcome difference and foster a consciously inclusive environment for everyone. We are Farfetch For All. Technology We’re on a mission to build the technology that powers the global platform for luxury fashion. We operate a modular end-to-end technology platform purpose-built to connect the luxury fashion ecosystem worldwide, addressing complex challenges and enjoying it. We’re empowered to break traditions and disrupt, with the freedom and autonomy to make a real impact for our customers all over the world. Porto Our Porto office is located in Portugal's vibrant second city, known for its history and its creative yet cosy environment. We welcome new ideas and a large number of our people. From Account Management to Technology and Product, whatever your skills are, you'll find your fit here. You can have an informal meeting in the treehouse or play the piano in your lunch break! The role We are looking for a Software Engineer who is motivated to build world-class applications using top notch technology. You will be working in a very friendly and relaxed environment and be part of a well-motivated, talented and growing team. If you love to learn, if you are willing to share knowledge and would love to be part of the building process to reach the top, using the latest technology stack and having fun doing it, this is an opportunity you can’t miss. What you'll do Contribute to the development of our E-Commerce Platform and the evolution of our Marketplace; Stay up to speed with all backend and web technologies, software architecture principles and design patterns; Apply your knowledge on performance and security measures; Being able to work in an Agile environment, focusing on delivery/commitment and software continuous improvement; Work with the following technologies: Apache Cassandra, Neo4j, Redis, MongoDB, Asp.net Core, Kafka, RabbitMQ, ActiveMQ, Identity Server, OpenID Connect. Who you are An experienced object oriented languages programmer Knowledgeable of unit tests and/or integration tests Knowledgeable of SQL language and experience using relational databases with preference for SQL Server Knowledgeable of REST APIs Experienced in NoSQL databases and SOA architecture is a plus A professional with experience working with SCRUM methodologies is also a plus Proficient in written and spoken English Motivated to build world-class applications using top notch technology. Show moreShow less",
    "link": "https://pt.linkedin.com/jobs/view/software-engineer-backend-at-farfetch-2203016917?refId=65eb216d-c988-47cf-9445-234cf2399959&position=10&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Apparel & Fashion, Consumer Goods, Retail"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Development Engineer I",
    "company": "Mastercard",
    "place": "Vancouver, British Columbia, Canada",
    "date": "2020-10-16",
    "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Software Development Engineer I Overview Who is Mastercard? We are the global technology company behind the world’s fastest payments processing network. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless®. We ensure every employee has opportunity to be a part of something bigger and to change lives. We believe as our company grows, so should you. We believe in connecting everyone to endless, priceless possibilities. Mastercard Launch is a full-time graduate development program designed to build the skills we leverage most as an innovator in the payments space, connects employees in enriching ways, and immerses new talent into our Doing Well by Doing Good culture. This program is meant for those who dare to be greater and those who wish to make a real impact in the world. Eligibility requires degree completion of a bachelors or masters degree in December of 2020 or May 2021. Mastercard’s software engineering teams leverage Agile development principles, advanced development and design practices, and an obsession over security, reliability, and performance to deliver solutions that delight our customers. As a software development engineer, you’ll develop advanced technologies and applications that are revolutionizing payments. Are you passionate about software engineering? Do you enjoy seeing the impact your code has on a wide range of customers? Do you want to work for a company that offers above and beyond benefits including paid parental leave, flexible work hours, gift matching, and even volunteer incentives while encouraging your own professional learning and development? Do you thrive in a place where you are continuously learning more while growing your skills and career? Do you want to join a Company that offers a competitive benefits-and rewards program that attracts, develops and retains the most talented employees around the world? Do you want to join an inclusive culture where employees, in all their diversity, feel valued, respected and who can bring their authentic selves to work? Learn more at Mastercard’s Corporate Sustainability Report. Role Hands-on developer who writes high quality, secure code for a small to mid-sized component or feature that is modular, functional and testable. Contribute to all parts of the software’s development including design, development, documentation, and testing. Have strong ownership of your team’s software and are deep in the maintenance characteristics, runtime properties and dependencies including hardware, operating system, and build. Communicate, collaborate and work effectively in a global environment. All About You Currently enrolled in a bachelor’s or master’s degree program majoring in Computer Science or a related field with a graduation date of December 2020 or May 2021. Strong foundation in algorithms, data structures and core computer science concepts. Evidence of working with object-oriented development and design patterns. Proficiency in one or more modern programming languages such as Java, Python, C++ Strong written and verbal English communications skills. Strong analytical and excellent problem-solving skills. Experience working in an Agile environment. Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly. Show moreShow less",
    "link": "https://ca.linkedin.com/jobs/view/software-development-engineer-i-at-mastercard-2186369002?refId=65eb216d-c988-47cf-9445-234cf2399959&position=11&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Financial Services, Information Technology and Services, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "JPMorgan Chase & Co.",
    "place": "Bengaluru, Karnataka, India",
    "date": "2020-10-15",
    "description": "Job Description: Application Developer - Software Engineering Responsibilities will include: Understanding Business Requirements and Functional Specifications. Ability to understand high level payment processing flows and stages in various type of payment processing in the world (clearing systems of the respective central banks) Work with business/Product to document high level and detailed requirements Providing estimates for required development Creation/ update of Detailed Design Specifications, Program Specifications for 3 tier or micro service applications Coding of new programs and changes to existing programs. Get the code reviewed by leads and SME's and participate in code reviews. Write Junits and end to end testing using frameworks like cucumber Providing technical support for User Acceptance Testing Creation of Implementation/ Back out Plans and Support Handover Documents Providing technical support for Production Implementations, and post-implementation support during implementation warranty period Key Skills Application development skills Strong analysis & problem solving skills. Strong in fundamentals like data structures, algorithms. Excellent communication skills - both verbal and written Ability to work independently with limited supervision Proven ability to use own initiative to resolve issues Full ownership of projects/tasks Ability and willingness to work under pressure, on multiple concurrent tasks, and to deliver to agreed deadlines Eagerness to learn Strong team working skills Understanding of Agile methodologies. Experience in working with groups that are set-up across globe. Work with requirements which may not be available to the last level of detail. Primary skills - Must have: Proven hands on experience in Java 8/9, J2EE, Spring Framework, web services (REST) and hibernate. Strong experience in using RDBMS (Oracle). Demonstrated experience in writing Junits for unit testing to achieve >90% code coverage. Experience in basic Unix / Shell scripting. Hand's on experience in fine tuning application response / performance testing. Experience in using tools like JMeter/JProbe etc. Experience in Micro service, Spring Boot. Experience in using code scanning tools like black duck and tools like Sonar etc. Hands on experience in using build automations tools like maven or gradle Familiarity with JIRA Good to have Basic understanding of distributed caching (gemfire/redis), Cloud (AWS or GCP) offerings. Basic understanding of CI/CD, experience of using Jenkins Basic understanding of infrastructure, deployment architecture - webserver, app server, database server, load balancer, HA setup, Sustained Resiliency) Familiarity with ELK Stack (Elastic search, logstash, Kibana) for monitoring Understanding of Docker, Kubernetes Knowledge of Casandra or MongoDB Distributed messaging experience such as Kafka Advantage: Experience in BFSI industry, exposure to core banking and payments Knowledge of industry-wide technology trends and best practices Some recent and successful experience in a properly functioning agile team would be extremely advantageous. JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management. We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs. Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-jpmorgan-chase-co-2184093511?refId=65eb216d-c988-47cf-9445-234cf2399959&position=12&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Information Technology",
    "employmenttype": "Full-time",
    "industries": "Banking"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Nykaa",
    "place": "Gurgaon, Haryana, India",
    "date": "2020-09-27",
    "description": "As a Backend Developer, You will be involved in all aspects of development playing a critical role in design, planning, development and deployment and help develop best practices for future development. You will be working closely with Product, Design and QA team to build and launch the product. Responsibilities Developed complex software products that include scale, algorithmic complexity and huge amount of data. Build cutting-edge scalable systems by writing simple and efficient code. Code, develop, design and architect features related to the existing application. We expect you to own modules end to end and take pride in the work products you ship Contribute to all aspects of an agile software development lifecycle including design, architecture, development, documentation, testing and operations. Design, implement and maintain highly scalable, multi-tier, distributed serv Requirements Total of 2-6 years- experience building cutting edge products. Must have a degree in Computer Science or related field. Strong understanding of object-oriented programming, concurrency and fundamentals of computer-science. Technically Hands-on, prior experience with scalable Architecture. Bring 2-5 years of software engineering and product delivery experience, with strong background in algorithms. Excellent command over Data Structures and Algorithm Proficiency in implementation of algorithms and use of advanced data structures to solve problems in computing Exceptional coding skills in an Object Oriented programming language (Java preferred). Strong problem solving and analytical skills. Experience with web technologies Java, Python, Linux, Apache, MySQL, solr, memcache, redis. Experience in architecting & building real-time, large scale e-commerce applications. Experience with high performance websites catering to millions of daily traffic is a plus. Skills Java/ Python, MySQL, Redis, ElasticSearch, Problem Solving, Scalability, Design Patterns, Distributed System Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-nykaa-2202792719?refId=65eb216d-c988-47cf-9445-234cf2399959&position=13&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Internet, Information Technology and Services"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer - Samza",
    "company": "LinkedIn",
    "place": "Sunnyvale, CA",
    "date": "2020-10-15",
    "description": "LinkedIn was built to help professionals achieve more in their careers, and everyday millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We are much more than a digital resume – we transform lives through innovative products and technology. Creating economic opportunity for every member of the global workforce is a responsibility we all share. To truly transform the global economy, we must evolve the way we hire and enable our talent to serve people of all backgrounds and experiences. LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. The samza team builds cutting-edge stream processing infrastructure that powers real-time data analysis for most major products at Linkedin, such as all notifications and communications, security, threat screening, and image processing. As a software engineer in the samza team, you will be working on some of the most interesting infrastructure you can find, involving highly available and reliable distributed computing & storage, critical performance considerations, complex data analysis, and execution of ML models at large scale. Your work will directly impact hundreds of engineers within LinkedIn and numerous more through our commitments to open source. Responsibilities You are expected to communicate well with peers in your team and in other teams, plan, design, coordinate, code, test and ship features that impact the work of hundreds of engineers and most major products at LinkedIn. You are expected to act like an owner, to lead yourself, to have a sense of urgency and to strive for excellence in everything that you do. You will build and improve components in a large distributed system that is mission critical and at the front lines of new developments You will work with a team of very capable engineers, with a wide range of experience levels, some of whom are leaders within the stream processing community at large You will learn a lot about building and running resilient large scale distributed systems and about the challenges of dealing with big data and real time analysis Basic Qualifications BS in Computer Science or related technical field or equivalent technical experience 1+ years of industry experience Experience in Java and/or C++ Preferred Qualifications MS or PhD in Computer Science or related technical discipline Record of excellence, taking initiative, shipping software and having impact Experience in any of the following is not required, but helpful: Building cloud services, AWS, Azure Java Building distributed, internet-scale systems Contributing to open source projects Working with stream processing Other Infrastructure work Equal Opportunity Statement LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information. LinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to apply for a position, please contact us by sending an email to accommodations@linkedin.com. This email box is designed to assist disabled job seekers who seek a reasonable accommodation to the application process. Emails sent for non-disability related issues, such as following up on an application, will not receive a response. In your email, please include the following: (1) confirm you have a disability; (2) identify the disability-related limitation that needs to be accommodated, and (3) if known, describe the specific accommodation requested for the disability-related limitation. A response to your request may take up to three business days. LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information. Pay Transparency Policy Statement As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency. Global Data Privacy Notice for Job Candidates This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-samza-at-linkedin-2185772670?refId=65eb216d-c988-47cf-9445-234cf2399959&position=14&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Engineering",
    "employmenttype": "Full-time",
    "industries": "Internet, Information Technology and Services"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "software development engineer I",
    "company": "Starbucks",
    "place": "Seattle, WA",
    "date": "2020-10-16",
    "description": "Job Summary And Mission At Starbucks, our mission is to inspire and nurture the human spirit - one person, one cup, and one neighborhood at a time. Starbucks Technologists work to achieve this mission through the use of cutting-edge technology delivered to our customers, stores & partners. This job contributes to Starbucks success by delivering a suite of tools and services to unlock testing opportunities for our internal customers. We are seeking to create a unified set of tools for all of Starbucks technology to leverage. Our automation tools currently run 100s of thousands of tests daily and protect our most important customer scenarios including Mobile Order and Pay, Loyalty, and Payments. If you are passionate about quality and developing cutting edge tools, then we want to hear from you! Summary Of Key Responsibilities Design & develop APIs, Data storage and UI to enable deeper and more comprehensive testing across all of Starbucks Tech Establish cross-functional, collaborative relationships with business and technology partners Analyze data, provide insights, and communicate findings to peers and customer teams Conduct research and make recommendations on improvements to systems, tools, and processes Champion deeper automation capabilities across our broader teams & systems, to keep providing better success and forensic capabilities from existing automation data Basic Qualifications Bachelor’s degree in computer science or related discipline Basic proficiency in one programing language such as C#, Java, or C++ Knowledge of object-oriented design, design patterns, and programming skills Preferred Qualifications Preferred Experience (or Capstone projects) with: Designing and developing distributed systems Introduction to Database and/or data storage Machine learning, predictive modeling or statistical techniques for data analysis React / React Native Starbucks and its brands are an equal opportunity employer of all qualified individuals. We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply. Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-development-engineer-i-at-starbucks-2187518329?refId=65eb216d-c988-47cf-9445-234cf2399959&position=15&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Information Technology, Engineering",
    "employmenttype": "Full-time",
    "industries": "Consumer Goods, Food & Beverages, Retail"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Unscrambl, Inc",
    "place": "Philippines",
    "date": "2020-10-13",
    "description": "As a Software Engineer, you will be working at the forefront of building new, innovative AI solutions with Unscrambl. Our fast growing team is looking for talented Software Engineers who will extend and improve integration, build features that drive customer adoption, and evolve our systems to scale with rapidly increasing customer demand. Some of the tasks you will be involved in are as follows: Define, design, and implement software applications. Estimate engineering effort, plan implementation, and rollout system changes that meet requirements for functionality, performance, scalability, reliability, and adherence to development goals and principles. Must be able to independently design code and test major features, as well as work jointly with other team members to deliver complex changes. Must be able to effectively collaborate in a fast paced environment with multiple teams in a large organization (software development, QA, Project/Release Management, Build and Release, etc.,). Provide on-call support for production product issues. Write back to us if: You have a Bachelors or Masters Degree in Computer Science or a related field with 2-5 years professional experience in software development You are proficient in at least one modern object oriented programming language such as Java or Typescript You have a good understanding of CS fundamentals, data structures and algorithms You have working knowledge of UNIX or Linux systems You have excellent interpersonal and communication skills You're obsessed with code quality and customer experience You have attention to detail coupled with the ability to think abstractly You have excellent problem solving skills Think you're a fit for this role? Please fill-up this form and we will get back to you the soonest: https://forms.gle/jnKv68N4W2r6vAD36 Know more about us at www.unscrambl.ai Show moreShow less",
    "link": "https://ph.linkedin.com/jobs/view/software-engineer-at-unscrambl-inc-2179973960?refId=65eb216d-c988-47cf-9445-234cf2399959&position=16&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Computer Software"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Microsoft",
    "place": "Hyderabad, Telangana, India",
    "date": "2020-10-13",
    "description": "A Software Engineer with strong security insights is a great story to share. Are you obsessed with writing great software that scales and want to be a part of a highly motivated team that is focused on building systems that make greater impact? Do you enjoy building and implementing next generation Digital Security and Risk Management solution at scale to support enterprise level needs which empowers cross functional teams to deliver quickly? If this is you, we have a wonderful opportunity for you. This position need a software developer with strong development background and able to collaborate with domain experts, architects and senior technical teams throughout the program life cycle. In this role, you will be a team player with a keen eye for detail and problem-solving skills. If you also have experience in Agile frameworks and popular coding languages (e.g.ASP.Net, C#, SQL programming, any scripting languages), we’d like to meet you. Responsibilities The software development engineer will be accountable for the following: Be responsible for owning multiple services, architecting them to scale, and have robust unit tests to deliver high quality products. Solve problems at their source, stepping back to understand the broader context, and implementing fixes to ensure that it never occur again. Stay abreast of new techniques, tools and methodologies used to address the critical developmental areas. Design, develop, test, deploy, maintain, and improve applications to support the business to drive and enable security across systems. Provide ongoing maintenance, support and enhancements in existing systems and platforms. Work closely with business and engineering partners during early SDLC phases to understand the business capabilities and goals for the program Technical Expertise Should have strong full-stack programming skills with ability to write optimized and reusable code. Should have good exposure in working on cloud ecosystem. Demonstrated experience developing the enterprise applications using Microsoft technology stack. Should have experience in SQL Server Programming, Object Oriented Programming, .NET framework, ASP.NET, MVC, C#, and along with exposure to cloud services (Azure, AWS...) Should have exposure to Scripting Languages PowerShell, Python etc. and exposure to TFS/VSO and Git Education & Experience Master’s / bachelor’s degree in Engineering/ Computer Science. Strong 7+ years of demonstrated work experience in the Information Systems industry. 4+ years of programming experience ASP.Net, C#, SQL, PowerShell, or other scripting languages. Digital Security & Risk Engineering (DSRE), an organization led by Microsoft’s Chief Information Security Officer, enables Microsoft to deliver the most trusted devices and services. DSRE’s vision is to ensure all information and services are protected, secured, and available for appropriate use through innovation and a robust risk framework. Qualifications Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work. Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-2181302145?refId=65eb216d-c988-47cf-9445-234cf2399959&position=17&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Computer Hardware, Computer Software, Information Technology and Services"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer, Web",
    "company": "Strava",
    "place": "Multnomah County, OR",
    "date": "2020-10-02",
    "description": "About The Role Strava’s Trust and Safety team is looking for an engineer with full-stack web development experience to help us build the tools and experiences that make the Strava platform an inclusive and trusted community. As a member of our team, you'll be working with a cross-functional group of engineers, product managers, designers, researchers, and analysts to keep our community engaged and safe. You will improve existing features and craft new ones, both on the web and via the API that supports our mobile apps. The Trust and Safety team is based in our Denver, CO office, and this position has the potential to become our first fully remote team member when we return to the office environment. You’re Passionate About This Opportunity Because You Will Make substantial contributions to our community’s ability to participate on Strava in a controlled, informed, and safe manner. Work with and learn from the experienced engineers (and others) on our team and across the company. Build, support, and own athlete experiences that are powered by technologies like React and Ruby on Rails. Directly impact the experience of tens of millions of athletes. We’re passionate about you because you: Have experience working with front-end JavaScript frameworks (like React or similar). Have good HTML/CSS fundamentals. Have exposure to backend technologies (like Ruby on Rails or similar). Have a product and user-focused mindset. You will be successful here by: Taking ownership of your work, partnering with multi-functional peers to ensure projects are accurately prioritized and implemented. Engaging in mentorship opportunities to help you grow as an engineer. Demonstrating empathy for athletes and their experience while using Strava. We'd love to talk to you about the future of Strava’s core technologies and your role in developing them. For more on Strava’s engineering team check out the Engineering Blog . It covers a wide range of topics, from how we rebuilt our leaderboard systems to personal perspectives on what it’s like to be an engineer at Strava. About Strava Strava is Swedish for “strive,” which epitomizes who we are and what we do. We’re a passionate and committed team, unified by our mission to connect athletes to what motivates them and help them find their personal best. And with billions of activity uploads from all over the world, we have a humbling and audacious vision: to be the record of the world’s athletic activities and the technology that makes every effort count. Strava builds software that makes the best part of our athletes’ days even better. And just as we’re deeply committed to unlocking their potential, we’re dedicated to providing a world-class, inclusive workplace where our employees can grow and thrive, too. We’re backed by Sequoia Capital, Madrone Partners and Jackson Square Ventures, and we’re expanding in order to exceed the needs of our growing community of global athletes. Our culture reflects our community – we are continuously striving to hire and engage diverse teammates from all backgrounds, experiences and perspectives because we know we are a stronger team together. In light of the global pandemic, Strava is currently working in a fully remote capacity. As always, we remain committed to fully supporting our employees, especially their mental health and wellbeing, through these challenging times. Despite challenges in the world around us, we are continuing to grow camaraderie and positivity within our culture and we are unified in our commitment to becoming an antiracist company . We are differentiated by our truly people-first approach, our compassionate leadership, and our belief that we can bring joy and inspiration to athletes’ lives — now more than ever. All to say, it’s a great time to join Strava! Strava is an equal opportunity employer. In keeping with the values of Strava, we make all employment decisions including hiring, evaluation, termination, promotional and training opportunities, without regard to race, religion, color, sex, age, national origin, ancestry, sexual orientation, physical handicap, mental disability, medical condition, disability, gender or identity or expression, pregnancy or pregnancy-related condition, marital status, height and/or weight. Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-web-at-strava-2208588583?refId=65eb216d-c988-47cf-9445-234cf2399959&position=18&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Computer Software, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Battlefy",
    "place": "Vancouver, British Columbia, Canada",
    "date": "2020-10-05",
    "description": "Software Engineers are an essential part of Battlefy's Product Team. Working closely with designers and product managers, we implement and maintain the user interface and production systems. We make the most of modern tools like React, Storybook, ES6, and even our next-generation apps are built with React Native. In Vancouver, the Engineering team is building world-class software to ensure our global customers, players, and organizers have a great esports experience on Battlefy. We value passion and drive but we also believe that diversity is the key to success for every high growth technology startup. We welcome people from all walks of life. Requirements You Are A passionate, entrepreneurial-spirited technologist that owns delivery from concept through to completion A relentless advocate for engineering excellence, dedicated to coaching and mentoring others A product thinker, who balances user pains and business needs while being pragmatic in making data-informed decisions An expert at communicating, knowing exactly how to collaborate with sales, marketing, user experience, product managers and other engineers Constantly curious, always looking to learn and increase your knowledge Passionate about the spirit of competition (gaming, traditional sports) You Will Engineer reliable and maintainable software to meet the application and infrastructure needs of the Battlefy platform Wear many hats working across Engineering, DevOps and Quality Assurance Set professional goals and do everything in your power to surpass them. Embody our core values by being people-first, exhibiting your determination to win, and continuously improving. Your Experience At least 1 year of experience building and maintaining software for paying customers At least 6 months of experience working remotely You have built and/or maintained ambitious React applications You have worked in a fast growth environment with teamwork being the foundation of achieving objectives You know what technical debt is -- you're pragmatic and know when to make trade-offs between architectural purity and reality You either know or are able to demonstrate that you can master the following JavaScript (ES6) and Node.js React or similar modern frontend libraries/frameworks MongoDB, PostgreSQL, Redis Amazon Web Services Bonus Points if you… Have worked in startup environments Have experience in organizing or competing in esports tournaments Have done tech talks at local events Have written blog posts Ran your own venture (even if it failed) Benefits What you’ll get Stock Competitive salaries Paid time off Company hardware Much more... Thank you for your interest in Battlefy! Only shortlisted applicants will be contacted. Battlefy is an Equal Employment Opportunity employer. Show moreShow less",
    "link": "https://ca.linkedin.com/jobs/view/software-engineer-at-battlefy-2183018000?refId=65eb216d-c988-47cf-9445-234cf2399959&position=19&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Mid-Senior level",
    "jobFunction": "Engineering",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Computer Software, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Toyota Connected North America",
    "place": "Plano, TX",
    "date": "2020-10-15",
    "description": "Toyota Connected’s Mobility team is responsible for building and managing our connected vehicle platforms, supporting product research using vehicle sensor data and creating new and exciting data services for Toyota customers that makes driving safer, more convenient, and fun. We are looking for a Software Engineer like you to help develop, validate and deploy complex cloud-based products at Toyota Connected. We are creating the next generation vehicle telematics and safety services platform to tackle super complex data, connectivity, and service delivery challenges that emerge when you have millions of people driving globally that demand immediate access to contextual and relevant information. Responsibilities: Operate in a highly-iterative Agile development environment Engineer efficient, adaptable and scalable microservice architectures in the cloud to process, store and expose unstructured big data Think independently to solve difficult data problems Work closely with product owners and other team members to deliver next generation connected car data services Monitor performance and provide advice for any necessary infrastructure changes Qualifications: You have programming expertise in Java and/or Scala You have production experience with Spring Boot and similar frameworks Experience with building micro-service based architectures Experience in one or more modern database technologies Working experience and good understanding of public cloud environments such as AWS, Azure, and/or Google Cloud Experience building near real-time streaming applications is a plus Experience with cloud infrastructure and Infrastructure as code such as Terraform or CloudFormation is a plus Experience building CI/CD pipelines is a plus Experience deploying applications with Kubernetes is a plus Experience with serverless architecture is a plus We think the knowledge acquired earning an BS in Computer Science, Engineering, Mathematics, or a related field would be of great value in this position, but if you're smart and have the experience that backs up your abilities, for us, talent trumps degree every time What’s in it for you? In addition to an excellent compensation and benefits package, you’ll also receive: A Career Path that allows you to take your career to the next level. Annual $2,000 Training Budget to help you grow and develop. Unlimited time off and flexibility for a great worklife balance. At TC you'll be treated like the professional we know you are and left to manage your own time and work load. Four months of paid parental leave. We want new moms and dads to have an opportunity to bond with their new little bundles of joy. 401(k) with generous company match that is fully vested Day One. Toyota and Lexus vehicle discounts to allow you to drive in style. Annual Patent-a-thons and Hackathons to embrace your superior creative thinking ability. Annual gym membership reimbursement. We have a Toyota Connected fit club that loves plank competitions! Free catered lunches every day. We try to keep it healthy, but Fridays are “cheat” days, so you can get your carbs on! Two fully stocked Nespresso bars for your coffee and tea fixes. Stocked kitchens with healthy snacks including fresh fruit, almonds, mixed nuts, pretzels, trail mix, and flavored waters. Nobody is hangry here! Fun game room for the gamer that lives inside you! Xbox, virtual reality, and Nintendo Switch gamers live here and are always ready for their next opponent. No dress code! Come as you are. We know the smart people we hire don’t need to be told what to wear. Free covered garage parking to shield your vehicle from those sneaky storms and to protect your buns from the Texas sun. Who Are We? Toyota Connected is a new company created to infuse the power of big data and cloud intelligence into all aspects of the mobility experience so that driving a Toyota or Lexus is more personal, intuitive and safe. We create and enable technologies that delight, simplify and connect the lives of those who use our products. We believe this mobility revolution will empower our customers to use their vehicles in an array of exciting new ways. We support, celebrate and thrive on the opportunity to provide Mobility for All. Making a connected life a more human experience takes humans from all walks of life. Toyota Connected celebrates and is committed to a diverse and inclusive workplace that embraces you regardless of your gender, religion, sexual orientation, skin color, age, disability, military or veteran status, big shot relative, or Instagram fame. Different makes us awesome. Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-at-toyota-connected-north-america-2209806537?refId=65eb216d-c988-47cf-9445-234cf2399959&position=20&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Mid-Senior level",
    "jobFunction": "Information Technology",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Information Services, Automotive"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "VMware",
    "place": "Los Angeles, CA",
    "date": "2020-10-02",
    "description": "Ready to build? So are we. Come join VMware’s Connectivity APIs team. We build the networking foundation for our portfolio of products across the Modern Applications Business Unit (MAPBU). We do this by researching our product teams’ needs, understanding the Kubernetes networking ecosystem, and building modular pieces like Kubernetes controllers and custom resources. We work with Go, YAML, Kubernetes, and various open-source projects. We care deeply about collaboration, both with the open source community and within our own team. Externally, we deeply focus on the Kubernetes networking domain, where we strive to engage with the open source community. Internally, we encourage XP Agile practices like pair programming, test driven development, continuous integration. We believe sustainable pace and psychological safety foster creativity and a productive work environment. We build software and solve problems collaboratively. Teammates are always accessible to lend a helping hand both remotely and in-person. We prefer candidates based in Santa Monica, San Francisco or Seattle, but are open to candidates elsewhere who are able to work Pacific time zone hours. The Opportunity The Connectivity APIs team is seeking a Software Engineer. In This Role You Will Define networking frameworks and APIs that will apply across the Tanzu products. Consult with internal VMware developers to ensure Tanzu adoption of these solutions Collaborate with open source communities to ensure adoption in the wider Kubernetes ecosystem. Build Kubernetes components and plugins that will serve as reference implementations for other teams and ship as part of production commercial offerings. Contribute to open source Kubernetes projects. Become a local expert on Kubernetes networking. Desired Skills & Experience Experience building distributed systems, ideally in the Kubernetes or container networking domain Collaboration with Open Source communities Openness to or experience with XP-flavor Agile Practices like pair programming, test driven development, and continuous integration Minimum three to five years of professional software development experience What Is It Like To Work At VMware? We believe that teams should spend more of their time delivering incremental value and less on building infrastructure. We’re building platforms, tools, and automation, including Tanzu Application Service, Tanzu Kubernetes Grid, and Tanzu Mission Control, to enable our customers to easily and confidently develop and run the software that powers their business. Hundreds of companies rely on our platform to meet the needs of millions of their customers. Our engineers adopt appropriate processes as a way to go fast forever and deliver remarkable results. Our product managers and product designers work side-by-side with our engineers in small, empowered teams, using Lean and UCD as guides. We measure success by making our customers more productive, as both software developers and platform operators. We spend time with our customers to understand and build empathy for the jobs that they need to get done. Category : Engineering and Technology Subcategory: Software Engineering Experience: Manager and Professional Full Time/ Part Time: Full Time Remote: Yes Posted Date: 2020-09-29 VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com. Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law. Show moreShow less",
    "link": "https://www.linkedin.com/jobs/view/software-engineer-at-vmware-2187513802?refId=65eb216d-c988-47cf-9445-234cf2399959&position=21&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Computer Software, Financial Services"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "QuintoAndar",
    "place": "São Paulo, São Paulo, Brazil",
    "date": "2020-10-15",
    "description": "Be safe from Coronavirus With the spread of the new Coronavirus (Covid-19) increasing fast, we prioritize the safety of employees, partners, customers and candidates. Therefore, all of our teams are working from home. In addition, we have also adapted the hiring process for all our positions, so you can complete the steps without leaving your home and staying safe. About QuintoAndar QuintoAndar is a Brazilian technology company that was created to simplify the lives of those looking for a new home. We are changing the real estate market with a pioneering business model in the world. We have a lot of talented people working to ensure that thousands of people around Brazil live better. Our team already has over a thousand people and we have offices in São Paulo and Campinas. Our product is now available in more than 20 Brazilian cities. Software Engineer Responsibilities At QuintoAndar Develop independent (micro-)services that address specific solutions; Responsible for the entire lifecycle of their code; Contribute not only with your immediate team’s challenges but with the whole procut team team - by sharing inputs/code/etc. Improve the development experience at QuintoAndar by enhancing development tools, test coverage, and/or code structure; Participate actively in discussions and decisions of software design. Building and helping to create documentations; Create scalable, maintainable and user driven solutions. We use several different technologies from Java over SQL databases, to Polymer over MongoDB. We also have micro-services written in Python, gorgeous PWA experiences in React, complex data flows in Datomic . You don't need to know all these upfront, but we will give you space to learn and improve; Help organize software architecture to harmonically orchestrate our services architecture. Important Our recruitment process starts at the application form! If you really wish be a part of our team, endeavor to do well at this stage of the process. We analyze all the candidates individually, reading all applications and replying to everyone. Requirements What we are looking for Proficiency in at least one programming language and relational databases; Experience using RESTful APIs; People that are seeking to learn and deliver real impact through high-quality data-driven and structured software, valuing work-life balance; Fluency in Portuguese and knowledge in English - we usually use English to write our code, documentation, tools, reference materials and eventually talk to partners and co-workers from other countries. You'll stand out if you Know computer theory, including optimization of algorithms and distributed systems; Already developed scalable client-server mobile applications; Have experience with cloud service platforms and its services (AWS, GCP, Azure, etc); Understand how modern CD/CI works; Have some knowledge on containers and container-orchestration (eg. Kubernetes); Know how to test and tune scalability; Understand the work is never done; we are always taking care and evolving our services. Benefits Competitive salary package; Meal allowance (\"ticket refeição and/or ticket alimentação\"); Public transportation allowance*; Health plan; Dental plan (optional); Life insurance; Daycare subsidy; Subsidy to sports practicing (Gympass). Extended maternity and paternity leave; Reserved room for breast-feeding*; Discount on our parking lot;* Free transfer from Vila Madalena and Fradique Coutinho stations to the office*; Free bike rack in our parking lot.* Due to our new remote-work reality, that benefit may have changed. That will be informed to you throughout the hiring process. Language and location This job description is written in English because we frequently communicate with coworkers and suppliers who are from worldwide, for tools and internal materials as well. // A descrição desta vaga está escrita em Inglês porque para esta posição é necessário para a comunicação com colegas e fornecedores, que são de diferentes países, além do uso de ferramentas e materiais internos. Our office is in Sao Paulo, at Vila Madalena, near metro station 'Vila Madalena' and 'Fradique Coutinho'. We also have an office located in Campinas. Diversity & Inclusion at QuintoAndar At QuintoAndar, we believe diversity of perspectives and experiences guarantee a differentiated work environment, based on respect and valuing differences. Feel free to declare the information on the registration form. If you are not comfortable answering them, just choose the option \"I prefer not to respond\". This information helps us create an increasingly inclusive environment and it is used only for this purpose, it is confidential, and it will not impact your performance throughout the hiring process All of our job positions are open to people with or without disabilities. If you are a PWD and have not found any opportunities of your interest, register your resume in our talent pool, by clicking here.. Data Protection Policy The data entered in the selection process form is confidential and stored in a secure environment. We take appropriate technical and administrative measures to protect your data. To exercise your rights over your personal data, such as access to data, treatment confirmation, data correction, anonymization, blocking or deletion, and other rights with QuintoAndar, contact us at dataprivacy@quintoandar.com.br. To learn more about how we treat personal data at QuintoAndar access our Privacy Policy. Show moreShow less",
    "link": "https://br.linkedin.com/jobs/view/software-engineer-at-quintoandar-2210072750?refId=65eb216d-c988-47cf-9445-234cf2399959&position=22&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Not Applicable",
    "jobFunction": "Engineering",
    "employmenttype": "Full-time",
    "industries": "Marketing and Advertising, Information Technology and Services, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer - Backend",
    "company": "Charlotte Tilbury Beauty",
    "place": "London, England, United Kingdom",
    "date": "2020-09-19",
    "description": "The Role We’re looking for motivated, curious, collaborative new team members to help us deliver a game-changing roadmap of online and omnichannel features with luxury-level performance and reliability. You’ll get to work with a welcoming, inclusive team of talented Engineers, Data Scientists, Product Managers and Digital Product Designers. The Team The Tech team at Charlotte Tilbury has been on an amazing journey over the last two years. From a rapid replatform, to building amazing new features and in-store experiences. Now we’re focused on creating ground breaking tools to help deliver our legendary services in a socially distanced world. We’re inviting you to join us on the next stage of our exciting journey to change the face of retail. Our brilliant Engineering team learns and continuously improves to deliver a luxury experience for our customers. We want Charlottetilbury.com to be easy to choose and easy to use, just like our products, and bring the incredible retail theatre from our physical stores online to offer a genuinely stand-out experience that keeps our customers coming back for more. We embrace agile principles and value collaboration both in Tech and with the rest of our colleagues across the business. As a Software Engineer you will Have experience of writing production-quality Java on the Backend Love collaborating and working with other Engineers, Product Managers, Digital Designers and Stakeholders Be passionate about the quality of you code and that its use in production Requirements You'll love working in Tech at Charlotte Tilbury if You love to build things that delight customers You want to want to make a difference in a genuinely disruptive and growing business You prefer collaboration to strict process You get a buzz out of working with a team of people who are diverse in background, experience and skill set You love to delve into data to gain insights and make decisions, but can also trust the instincts of yourself and your colleagues when data isn’t there Our Tech Stack is React and Redux NextJS Typescript SCSS Node 12 Java 11 with Spring Boot Elasticpath Contentful AWS Elastic Container Service Lambda Aurora (MySQL) Our toolset includes CircleCI Github NewRelic Kibana Optimizely Benefits Dog friendly office Generous staff discount to use on our products Access to Tilbury Treats – our very own rewards platform allowing you to save money and gain ‘money can’t buy’ discounts on anything from gym memberships to cinema tickets Other fabulous benefits such as life assurance, birthdays off work, and many more Our Mission ‘TO MAKE EVERYONE FEEL THE MOST BEAUTIFUL VERSION OF THEMSELVES’ WE WOULD LOVE TO WELCOME YOU TO OUR TEAM! APPLY TODAY! Show moreShow less",
    "link": "https://uk.linkedin.com/jobs/view/software-engineer-backend-at-charlotte-tilbury-beauty-2183022552?refId=65eb216d-c988-47cf-9445-234cf2399959&position=23&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Mid-Senior level",
    "jobFunction": "Information Technology",
    "employmenttype": "Full-time",
    "industries": "Information Technology and Services, Internet, Retail"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "Nielsen",
    "place": "Chennai, Tamil Nadu, India",
    "date": "2020-10-13",
    "description": "Job Description MID- LEVEL ENGINEER- FULL STACK , TECHNOLOGY - CHENNAI About This Job In Nielsen Technology, we process over 250 terabytes of data every single day, manage it in the latest cloud technology, and build best-in-class analytical tools to add transparency and efficiency to the consumer goods market at a scale that no other company is able to achieve. We’re looking for a Software Engineer.- Mid level for our Nielsen Connect ecosystem. Responsibilities Write code to develop scalable, flexible and user-friendly applications across the full stack of technologies Develop secure and highly performant services and APIs Use distributed computing to validate and process large volumes of data to deliver insights Evaluate technologies we can leverage, including open-source frameworks, libraries, and tools Ensure the maintainability and quality of code enhancements. a Little Bit About You You’re a passionate, analytical, innovative Engineer who wants to figure out how to measure things in a complex world. You have a passion for building top-notch, scalable products and have full-stack experience. Qualifications A Bachelor’s or Master’s degree in Computer Science or related field. 5 + years of software development experience as a full stack developer. Strong knowledge of Core Java and Microstrategy 10.10 or plus; Good to have experience in Spring or hibernate or Spring boot. Having an experience in javascript or angular would be a plus Good problem solving and logical skills. Strong knowledge and working experience on Java and Javascript frameworks. Good experience in designing and building multithreaded distributed systems. Experience in agile software development practices and DevOps. About Nielsen We’re in tune with what the world is watching, buying, and everything in between. If you can think of it, we’re measuring it. We sift through the small stuff and piece together big pictures to provide a comprehensive understanding of what’s happening now and what’s coming next for our clients. Today’s data is tomorrow’s marketplace revelation. We like to be in the middle of the action. That’s why you can find us at work in over 100 countries. From global industry leaders to small businesses, consumer goods to media companies, we work with them all. We’re bringing in data 24/7 and the possibilities are endless. See what’s next with us at Nielsen Additional Information ABOUT NIELSEN We’re in tune with what the world is watching, buying, and everything in between. If you can think of it, we’re measuring it. We sift through the small stuff and piece together big pictures to provide a comprehensive understanding of what’s happening now and what’s coming next for our clients. Today’s data is tomorrow’s marketplace revelation. We like to be in the middle of the action. That’s why you can find us at work in over 100 countries. From global industry leaders to small businesses, consumer goods to media companies, we work with them all. We’re bringing in data 24/7 and the possibilities are endless. See what’s next with us at Nielsen: careers.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class. Show moreShow less",
    "link": "https://in.linkedin.com/jobs/view/software-engineer-at-nielsen-2179947832?refId=65eb216d-c988-47cf-9445-234cf2399959&position=24&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Entry level",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Marketing and Advertising, Information Technology and Services, Internet"
  },
  {
    "query": "Software Engineer",
    "location": "Anywhere",
    "title": "Software Engineer",
    "company": "BlaBlaCar",
    "place": "Kyiv, Kyiv City, Ukraine",
    "date": "2020-10-14",
    "description": "Company Description BlaBlaCar is the world’s leading long-distance carpooling platform – a global, trusted community of 90 million drivers and passengers in 22 countries. The platform connects people looking to travel long distances with drivers heading the same way, so they can travel together and share the cost. With the recent integration of a coach network and a commuter carpooling service, BlaBlaCar aims to become the go-to for shared road mobility. Affordable, convenient and user-friendly, wherever there’s a road, there’s a BlaBlaCar. Job Description Why join us? In order to constantly improve its usage and service, BlaBlaCar has launched recently a new business line that is set to fuel tremendous growth for the company. By joining the BlaBlaCar Pro team, you will have the unique opportunity of joining a new vertical at BlaBlaCar and of helping us become the n.1 destination for road transport. Within the Pro team, we are building the heart of our new technical platform dedicated to our bus transport partners. A brand-new ecosystem based on a service-oriented architecture that aims at helping worldwide bus companies to sell trips and manage their offers on our marketplace. By joining our experimented and talented tech team, you’ll contribute to the design and development of new services for bus professionals, making sure they are robust and scalable. You’ll build new platform features and you’ll manage the integration of new bus partners APIs. Thanks to your technical expertise and your communications skills you’ll work closely with our product and business experts as well as tech teams our partners. What you will directly contribute to: Reporting to the Engineering Manager, in a team of 8 engineers Building a robust and scalable backend that support BlaBlaCar websites and mobile apps, as well as connexions to external bus partners systems Taking part in the design definition of the services and their APIs to ensure they are scalable, robust and easy to use Interacting with multiple internal stakeholders (product managers, business analyst, data scientists, etc) and external bus partners tech teams Deploying and operating your services to production and ensuring they are performing as expected through monitoring and instrumentation Qualifications What you will need to be successful: 3-5+ years of experience in engineering teams within tech companies Strong proficiency in Java (Spring) and Object-Oriented development Open and eager to constantly learn new technologies A first experience in a Service Oriented Architecture ecosystem as well as other technologies such as Kafka ClikHouse, PL/SQL, Oracle, is a plus Be humble, structured, organized, motivated by innovation and a relentless doer Enjoy working as a team-player and learning from others Product-oriented spirit with the ambition to deliver the best experience to end-users Fluent in English & Ukrainian Additional Information A few practical details about the role: Start: As soon as you are ready! Location: Kyiv Contract: Permanent contract (CDI) Benefits: Competitive package according to profile and experience, combined with a career development plan What we offer all of our employees: The opportunity to have a meaningful impact, building a CO2-saving global travel network enabling strong human connections too. A strong “Fun & Serious” company culture An international environment with a team counting 35 nationalities, serving a global member-base from 8 offices around the world (Berlin, Kiev, Madrid, Milan, Moscow, Paris (HQ), São Paulo, Warsaw) State-of-the-art office spaces, in a great location And some other great perks! Free carpooling to live our value “Be The Member”. Annual BlaBlaBreak which takes us all for an unforgettable weekend Possibility to work from another BlaBlaOffice abroad for a week once a year (BlaBlaSwap) The choice between the latest Mac or PC equipment Opportunity to attend Tech conferences in France and Europe A start-up spirit grounded in agility & teamwork Challenging career opportunities in a high-growth and fast-paced environment Bi-Weekly team-all BlaBlaTalks to learn from each other Weekly Tech Demos, so that we’re all up to date with where our product stands What is next? If you are ready to join our exciting journey, please apply below: upload your resume in English (PDF format) and answer our questions in English. Kindly note that only complete applications will be reviewed by our hiring team and that all your information will be kept confidential. You can expect us to review your application within the following 3 weeks. If your application and profile fit our requirements, we will invite you for a (list the different steps of the process here). BlaBlaCar is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. I'm interested Show moreShow less",
    "link": "https://ua.linkedin.com/jobs/view/software-engineer-at-blablacar-2181917969?refId=65eb216d-c988-47cf-9445-234cf2399959&position=25&pageNum=0&trk=public_jobs_job-result-card_result-card_full-click",
    "senorityLevel": "Associate",
    "jobFunction": "Engineering, Information Technology",
    "employmenttype": "Full-time",
    "industries": "Internet"
  }
]
